## Pandas

### Instalação do Pandas

In [5]:
pip install pandas

SyntaxError: invalid syntax (<ipython-input-5-a07329a4e6e7>, line 2)

### Introduzindo Séries de Dados do Pandas

1 - Importe as bibliotecas pandas e numpy com os aliases 'pd' e 'np', respectivamente.

In [1]:
import pandas as pd
import numpy as np

2 - Utilize o numpy para criar um array com 10 elementos de números inteiros aleatórios entre 50 e 100. Em seguida, transforme-o em uma série do pandas e a exiba.

In [9]:
a1 = np.random.randint(50, 100, 10)
s1 = pd.Series(a1)
s1

0    74
1    67
2    84
3    88
4    98
5    69
6    99
7    51
8    90
9    75
dtype: int32

3 - Utilize a função range do Python para criar uma série do Pandas contendo 10 elementos cujos índices sejam uma sequência ascendente de números ímpares  e os valores sejam uma sequência descendente de números inteiros de 10 a 1. Em seguida, converta o tipo numérico da série criada para 'int32' e exiba a série.

In [5]:
for i in range(10, 1, 2):
    s2 = pd.Series(i)
    print (s2)

4 - Abaixo são definidos dois dicionários contendo capitais brasileiras com a população estimada para os anos de 2000 e 2018. Utilize ambos os dicionários definidos abaixos para criar dois objetos do tipo Series.

In [6]:
populacao2000 = {'São Paulo': 10405867, 'Rio de Janeiro': 5851914, 'Salvador': 2440828, 'Belo Horizonte':2232747, 'Fortaleza':2138234	}
populacao2018 = {'São Paulo': 12176866, 'Rio de Janeiro': 6688927, 'Brasília': 2974703, 'Salvador': 2857329, 'Fortaleza': 2643247}

v00 = populacao2000.values()
k00 = populacao2000.keys()
v18 = populacao2018.values()
k18 = populacao2018.keys()

p00 = pd.Series(v00,k00)
p18 = pd.Series(v18,k18)

#### Operações Aritméticas com Séries

5 - Crie uma nova série contendo a diferença entre as populações de 2018 e 2010.

In [7]:
dif0018 = pd.Series(p18 - p00)
dif0018

Belo Horizonte          NaN
Brasília                NaN
Fortaleza          505013.0
Rio de Janeiro     837013.0
Salvador           416501.0
São Paulo         1770999.0
dtype: float64

6 - Crie uma nova série contendo a média entre as duas séries iniciais.

In [8]:
med0018 = pd.Series.mean(p18 + p00, axis = 0)
med0018

11300803.0

### Introduzindo Dataframes

7 - Crie um dicionário cujas chaves sejam: 2000, 2018, 'diferenca', 'media'. Utilize como valores as séries correspondentes criadas nas questões anteriores. Utilize esse dicionário para criar um dataframe.

In [9]:
d1 = {'2000':p00, '2018':p18, 'diferenca':dif0018, 'media':med0018}
df1 = pd.DataFrame(d1)
df1

                      2000        2018  diferenca       media
Belo Horizonte   2232747.0         NaN        NaN  11300803.0
Brasília               NaN   2974703.0        NaN  11300803.0
Fortaleza        2138234.0   2643247.0   505013.0  11300803.0
Rio de Janeiro   5851914.0   6688927.0   837013.0  11300803.0
Salvador         2440828.0   2857329.0   416501.0  11300803.0
São Paulo       10405867.0  12176866.0  1770999.0  11300803.0

8 - Desta vez, crie um dataframe equivalente ao criado na questão anterior concatenando as quatro séries (referentes a 2000, 2018, diferença e média). Lembre-se de inserir os mesmos títulos para as colunas.

In [12]:
df2 = pd.DataFrame([p00, p18, dif0018, med0018], ['2000', '2018', 'diferença', 'média'])
df3 = pd.DataFrame.transpose(df2)
df3

                      2000        2018  diferença
São Paulo       10405867.0  12176866.0  1770999.0
Rio de Janeiro   5851914.0   6688927.0   837013.0
Salvador         2440828.0   2857329.0   416501.0
Belo Horizonte   2232747.0         NaN        NaN
Fortaleza        2138234.0   2643247.0   505013.0
Brasília               NaN   2974703.0        NaN

9 - Adicione uma nova coluna ao dataframe anterior chamada 2019, esta deve conter um acréscimo de 50000 sobre os valores da coluna 2018.

In [149]:
p19 = p18+50000.0
df3['2019'] = p19
df3

                      2000        2018  diferença        2019
São Paulo       10405867.0  12176866.0  1770999.0  12226866.0
Rio de Janeiro   5851914.0   6688927.0   837013.0   6738927.0
Salvador         2440828.0   2857329.0   416501.0   2907329.0
Belo Horizonte   2232747.0         NaN        NaN         NaN
Fortaleza        2138234.0   2643247.0   505013.0   2693247.0
Brasília               NaN   2974703.0        NaN   3024703.0

10 - Exiba somente os dados referentes a Salvador.

In [150]:
df3.loc['Salvador']

2000         2440828.0
2018         2857329.0
diferença     416501.0
2019         2907329.0
Name: Salvador, dtype: float64

11 - Exiba ** a terceira linha** do dataframe utilizando o seu posicionamento no dataframe.

In [151]:
df3.iloc[3]

2000         2232747.0
2018               NaN
diferença          NaN
2019               NaN
Name: Belo Horizonte, dtype: float64

12 - Exiba as **três primeiras linhas** do dataframe a partir da posição.

In [152]:
df3.iloc[:3]

                      2000        2018  diferença        2019
São Paulo       10405867.0  12176866.0  1770999.0  12226866.0
Rio de Janeiro   5851914.0   6688927.0   837013.0   6738927.0
Salvador         2440828.0   2857329.0   416501.0   2907329.0

13 - Remova a coluna 2019 criada anteriormente.

In [156]:
df5 = df3.drop('2019', axis =1)
df5

                      2000        2018  diferença
São Paulo       10405867.0  12176866.0  1770999.0
Rio de Janeiro   5851914.0   6688927.0   837013.0
Salvador         2440828.0   2857329.0   416501.0
Fortaleza        2138234.0   2643247.0   505013.0

14 - Remova os registros que apresentam valores nulos.

In [157]:
df5.dropna(axis = 0, inplace = True)
df5

                      2000        2018  diferença
São Paulo       10405867.0  12176866.0  1770999.0
Rio de Janeiro   5851914.0   6688927.0   837013.0
Salvador         2440828.0   2857329.0   416501.0
Fortaleza        2138234.0   2643247.0   505013.0

### Exercícios com base de dados fictícia (toy dataset)

Execute o bloco de código abaixo para realizar o download de uma pequena base de dados que será utilizada para os próximos experimentos. A base de dados poderá ser acessada através do arquivo toy_dataset.csv. Caso a sessão se encerre, re-execute essa célula de código.

In [33]:
!pip install -q kaggle
import os
os.environ['KAGGLE_USERNAME'] = "victorlundgren"
os.environ['KAGGLE_KEY'] = "851b67a8b7e626eb6336620bf1cb0d31"

!kaggle datasets download -d carlolepelaars/toy-dataset
!unzip toy-dataset.zip # OU tar -xy no Windows10

Downloading toy-dataset.zip to C:\Users\Breno Soares

  0%|          | 0.00/1.13M [00:00<?, ?B/s]
 89%|########8 | 1.00M/1.13M [00:00<00:00, 1.56MB/s]
100%|##########| 1.13M/1.13M [00:01<00:00, 644kB/s]
100%|##########| 1.13M/1.13M [00:01<00:00, 1.01MB/s]

'unzip' is not recognized as an internal or external command,
operable program or batch file.

15 - Execute a leitura do Toy Dataset diretamente em um dataframe.

In [3]:
df4 = pd.read_csv('toy_dataset.csv')
df4

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

16 - Exiba o tipo de dados de cada coluna do dataframe.

In [138]:
df4.dtypes

Number       int64
City        object
Gender      object
Age          int64
Income     float64
Illness     object
dtype: object

17 - Utilize a função .head() para exibir o cabeçalho do dataframe e assim conhecer as colunas, o índice e as linhas iniciais da base de dados.

In [139]:
df4.head(10)

   Number    City  Gender  Age   Income Illness
0       1  Dallas    Male   41  40367.0      No
1       2  Dallas    Male   54  45084.0      No
2       3  Dallas    Male   42  52483.0      No
3       4  Dallas    Male   40  40941.0      No
4       5  Dallas    Male   46  50289.0      No
5       6  Dallas  Female   36  50786.0      No
6       7  Dallas  Female   32  33155.0      No
7       8  Dallas    Male   39  30914.0      No
8       9  Dallas    Male   51  68667.0      No
9      10  Dallas  Female   30  50082.0      No

18 - Realize as seguintes operações:

- Adicione uma nova coluna chamada NumberAge e que apresente a soma entre os valores da coluna Number com os valores da coluna Age.
- Exiba o cabeçalho do dataframe resultante.
- Remova a coluna NumberAge.
- Exiba o cabeçalho do dataframe resultante.

In [162]:
# Passo 1
s1 = df4['Number'] + df4['Age']
df4['NumberAge'] = s1

# Passo 2
df4.head(5)

# Passo 3
df6 = df4.drop('NumberAge', axis = 1)

# Passo 4
df6.head(5)

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

19 - Realize as seguintes operações a partir do dataframe definido anteriormente:

- Exiba as cinco primeiras linhas do dataframe, todos os atributos devem ser apresentados com exceção do primeiro e último.

- Exiba as cinco últimas linhas do dataframe, exiba somente o atributo City.

In [167]:
# Passo 1
df6.iloc[0:5, 1:5]

# Passo 2
df6.iloc[-5:, 1]

149995    Austin
149996    Austin
149997    Austin
149998    Austin
149999    Austin
Name: City, dtype: object

20 - Ordene de forma ascendente as amostras utilizando como critério o salário anual. Em seguida, resete os índices dos registros.

In [171]:
# Passo 1
df7 = df6.sort_values(by = 'Income')

# Passo 2
df7.reset_index(inplace = True)

         index  Number           City  Gender  Age    Income Illness
0          245     246         Dallas  Female   40    -654.0     Yes
1         7896    7897         Dallas  Female   34     584.0      No
2        18484   18485         Dallas  Female   43    2474.0      No
3         9298    9299         Dallas  Female   31    2667.0     Yes
4        17135   17136         Dallas  Female   39    3842.0      No
...        ...     ...            ...     ...  ...       ...     ...
149995  112192  112193  Mountain View    Male   58  172825.0      No
149996  110877  110878  Mountain View    Male   52  173826.0      No
149997  109060  109061  Mountain View    Male   61  173991.0      No
149998  105281  105282  Mountain View    Male   41  176746.0      No
149999  109350  109351  Mountain View    Male   58  177157.0      No

[150000 rows x 7 columns]

**21 - Defina a coluna 'Number' como o índice do dataframe. Em seguida, exiba do segundo até o quinto registro a partir do posicionamento.**

In [182]:
# Passo 1
df7.set_index('Number', inplace = True)

# Passo 2
df8 = df7.iloc[2:6]

        index    City  Gender  Age  Income Illness
Number
18485   18484  Dallas  Female   43  2474.0      No
9299     9298  Dallas  Female   31  2667.0     Yes
17136   17135  Dallas  Female   39  3842.0      No
2119     2118  Dallas  Female   56  4371.0      No

22 - Desta vez, exiba os registros com Number variando de 2 até 5 a partir do próprio rótulo Number.

In [197]:
df9 =  df7.sort_values(by = 'Number').iloc[1:5]
df9

        index    City Gender  Age   Income Illness
Number
2           1  Dallas   Male   54  45084.0      No
3           2  Dallas   Male   42  52483.0      No
4           3  Dallas   Male   40  40941.0      No
5           4  Dallas   Male   46  50289.0      No

23 - Qual a cidade e o gênero da pessoa com a maior renda (Income)?

In [27]:
df10 = df4.sort_values(by = 'Income', ascending = False).iloc[0:1, 1:3]
df10

                 City Gender
109350  Mountain View   Male

24 - Quantas pessoas moram na cidade de Dallas?

In [28]:
df11 = df4['City'].value_counts().iloc[2]
df11

19707

25 - Qual a idade média das pessoas que estão doentes? Utilize o atributo Illness para obter essa informação.

In [80]:
df12 = df4[(df4.Illness == 'Yes')].mean().iloc[1]
df12

45.02084191449048

26 - Quantas pessoas tem um salário anual maior que R$ 30000?

In [79]:
df13 = df4[(df4.Income > 30000)].count().iloc[5]
df13

148218

27 - Quantas pessoas estão doentes?

In [78]:
df14 = df4.filter(items=['Illness']).value_counts().iloc[1]
df14

12139

28 - Quantas pessoas estão doente e apresentam renda (Income) menor que 35000 ou maior que 50000?

In [99]:
df15 = df4[(df4.Illness == 'Yes') & (df4.Income < 35000) | (df4.Income > 50000)].count().iloc[1]
df15

137043

29 - Mostre os registros que apresentam a menor idade encontrada e uma renda entre 40000 e 42000.

In [157]:
df16 = df4.sort_values(by = ['Age', 'Income'], ascending = False)
df18 = df16[(df16.Age < 26) & (df16.Income > 40000) & (df16.Income < 42000)]
df18

        Number             City  Gender  Age   Income Illness
8764      8765           Dallas  Female   25  41975.0      No
6963      6964           Dallas    Male   25  41654.0      No
7930      7931           Dallas    Male   25  41630.0      No
9775      9776           Dallas  Female   25  41612.0      No
8652      8653           Dallas  Female   25  41561.0      No
9955      9956           Dallas  Female   25  41444.0      No
5279      5280           Dallas  Female   25  41365.0      No
7674      7675           Dallas  Female   25  41288.0      No
18502    18503           Dallas    Male   25  41241.0      No
2091      2092           Dallas    Male   25  41013.0      No
2708      2709           Dallas  Female   25  40899.0      No
18190    18191           Dallas  Female   25  40795.0      No
10180    10181           Dallas  Female   25  40761.0      No
128931  128932  Washington D.C.  Female   25  40476.0      No
10739    10740           Dallas    Male   25  40467.0      No
16402    16403           Dallas  Female   25  40389.0      No
14606    14607           Dallas  Female   25  40363.0      No
5639      5640           Dallas    Male   25  40313.0      No
13563    13564           Dallas  Female   25  40076.0      No
2681      2682           Dallas  Female   25  40075.0      No

30 - Mostre os registros referentes a cidade de Dallas que apresentam a maior idade e que estão doentes.

In [187]:
df19 = df4[(df4.Age > 64) & (df4.City == 'Dallas') & (df4.Illness == 'Yes')].sort_values(by = 'Age',ascending = False)
df19

       Number    City  Gender  Age   Income Illness
1563     1564  Dallas  Female   65  38193.0     Yes
2378     2379  Dallas    Male   65  67526.0     Yes
17787   17788  Dallas    Male   65  40675.0     Yes
17727   17728  Dallas  Female   65  30468.0     Yes
16486   16487  Dallas    Male   65  56236.0     Yes
16223   16224  Dallas  Female   65  56795.0     Yes
15865   15866  Dallas    Male   65  36590.0     Yes
15662   15663  Dallas  Female   65  35688.0     Yes
14710   14711  Dallas  Female   65  34991.0     Yes
14436   14437  Dallas  Female   65  20732.0     Yes
13876   13877  Dallas    Male   65  42107.0     Yes
11235   11236  Dallas  Female   65  48395.0     Yes
10517   10518  Dallas    Male   65  32516.0     Yes
7586     7587  Dallas    Male   65  45705.0     Yes
7283     7284  Dallas    Male   65  54156.0     Yes
6073     6074  Dallas  Female   65  45253.0     Yes
4358     4359  Dallas  Female   65  34712.0     Yes
3923     3924  Dallas    Male   65  59748.0     Yes
3317     3318  Dallas    Male   65  48022.0     Yes
18497   18498  Dallas  Female   65  56754.0     Yes

31 - Obtenha os registros das pessoas que moram na cidade de Austin e que apresentam idade menor que 26 anos. Exiba cinco amostras.

In [188]:
df20 = df4[(df4.Age < 26) & (df4.City == 'Austin')]
df20.head(5)

        Number    City  Gender  Age    Income Illness
137848  137849  Austin    Male   25  101607.0      No
137865  137866  Austin    Male   25  109416.0      No
138052  138053  Austin    Male   25   86214.0      No
138157  138158  Austin  Female   25   95622.0      No
138263  138264  Austin    Male   25   87914.0      No

32 - Exiba as informações estatísticas básicas referentes as colunas do dataframe (média, desvio padrão, valor mínimo, valor máximo, primeiro quartil, segundo quartil, terceiro quartil). Dica: o pandas possui uma função para gerar uma estatística descritiva dos dados.

In [168]:
df4.describe()

              Number            Age         Income
count  150000.000000  150000.000000  150000.000000
mean    75000.500000      44.950200   91252.798273
std     43301.414527      11.572486   24989.500948
min         1.000000      25.000000    -654.000000
25%     37500.750000      35.000000   80867.750000
50%     75000.500000      45.000000   93655.000000
75%    112500.250000      55.000000  104519.000000
max    150000.000000      65.000000  177157.000000

33 - Apresenta a quantidade de pessoas doentes por cidade.

In [189]:
df21 = df4[(df4.Illness == 'Yes')].groupby('City').count().iloc[:, 1]
df21

City
Austin             1011
Boston              686
Dallas             1613
Los Angeles        2568
Mountain View      1178
New York City      4021
San Diego           394
Washington D.C.     668
Name: Gender, dtype: int64

34 - Armazene em uma nova variável o agrupamento dos dados do dataframe usado anteriormente tomando como critério o gênero e a cidade, nessa exata ordem. Utilize a média como função de agregação e exiba somente a idade e salário anual.

In [48]:
df22 = df4[(df4.Illness == 'Yes')].groupby(['City', 'Gender']).mean().iloc[:, 1:4]
df22

                              Age         Income
City            Gender
Austin          Female  44.379630   85133.405093
                Male    44.815199   93998.666667
Boston          Female  44.848185   86208.343234
                Male    45.851175   96606.261097
Dallas          Female  45.087571   39536.553672
                Male    44.918232   49764.566851
Los Angeles     Female  45.532637   89445.666667
                Male    45.107118   99454.835800
Mountain View   Female  44.867562  129001.310940
                Male    44.829528  139344.750381
New York City   Female  45.458592   91210.229296
                Male    44.630454  101685.501336
San Diego       Female  45.843137   96123.496732
                Male    44.809129  105633.668050
Washington D.C. Female  45.175862   65848.558621
                Male    44.097884   75306.825397

35 - Exiba o index do dataframe oriundo do agrupamento realizado na questão anterior.

In [199]:
df22.index

MultiIndex([(         'Austin', 'Female'),
            (         'Austin',   'Male'),
            (         'Boston', 'Female'),
            (         'Boston',   'Male'),
            (         'Dallas', 'Female'),
            (         'Dallas',   'Male'),
            (    'Los Angeles', 'Female'),
            (    'Los Angeles',   'Male'),
            (  'Mountain View', 'Female'),
            (  'Mountain View',   'Male'),
            (  'New York City', 'Female'),
            (  'New York City',   'Male'),
            (      'San Diego', 'Female'),
            (      'San Diego',   'Male'),
            ('Washington D.C.', 'Female'),
            ('Washington D.C.',   'Male')],
           names=['City', 'Gender'])

36 - Como visto na questão anterior, o agrupamento gerou um dataframe com índice multinível. Acesse os dados referentes ao gênero feminino.

In [211]:
df22.xs('Female', level='Gender', axis=0)

                       Age         Income
City
Austin           44.379630   85133.405093
Boston           44.848185   86208.343234
Dallas           45.087571   39536.553672
Los Angeles      45.532637   89445.666667
Mountain View    44.867562  129001.310940
New York City    45.458592   91210.229296
San Diego        45.843137   96123.496732
Washington D.C.  45.175862   65848.558621

37 - Desta vez, liste os dados indexando diretamente pela cidade de Boston. Assim, deve ser exibida a idade média e o salário anual médio para ambos os gêneros.

In [218]:
df22.iloc[2:4,:]

                     Age        Income
City   Gender
Boston Female  44.848185  86208.343234
       Male    45.851175  96606.261097

38 - Crie duas novas séries compostas de números aleatórios oriundos de uma distribuição normal. As séries devem ter o mesmo número de elementos que o dataframe, utilize como base os índices do dataframe criado anteriormente para construir as séries. Em seguida, concatene as duas séries horizontalmente e defina os títulos das colunas como 'Random 1' e 'Random 2'. Finalmente, concatene horizontalmente o resultado anterior com o dataframe imediatamente anterior aos agrupamentos realizados nas questões anteriores. Dica: lembre-se que o índice Number inicia em 1 quando for criar as séries de números aleatórios.

In [4]:
s4 = pd.Series(np.random.randn(150000), name="Random 1")
s5 = pd.Series(np.random.randn(150000), name="Random 2")

df23 = pd.concat([s4, s5], axis = 1)
df23

df24 = pd.concat([df4, df23], axis = 1)
df24

        Number    City  Gender  Age    Income Illness  Random 1  Random 2
0            1  Dallas    Male   41   40367.0      No -0.656802 -0.656938
1            2  Dallas    Male   54   45084.0      No -1.887151  1.264003
2            3  Dallas    Male   42   52483.0      No  0.004457 -0.824016
3            4  Dallas    Male   40   40941.0      No  0.319278 -0.889820
4            5  Dallas    Male   46   50289.0      No  0.097414  0.046453
...        ...     ...     ...  ...       ...     ...       ...       ...
149995  149996  Austin    Male   48   93669.0      No  2.228281 -2.316143
149996  149997  Austin    Male   25   96748.0      No -1.225631  1.212723
149997  149998  Austin    Male   26  111885.0      No  0.176426  0.418778
149998  149999  Austin    Male   25  111878.0      No -0.653005  0.972968
149999  150000  Austin  Female   37   87251.0      No  0.388007  1.392892

[150000 rows x 8 columns]

39 - Adicione uma nova linha com valores do tipo NaN (utilize o numpy.nan) no dataframe atual. Em seguida, preencha-a com a mediana dos valores de cada coluna na qual o valor nulo se encontra. Os atributos categóricos como Gender permanecerão como NaN, substitua-os com o valor não-nulo anterior ao registro. 

Dica: utilize uma nova variável para armazenar o dataframe para evitar modificações desnecessárias enquanto constrói os procedimentos. Para acompanhar o estado do dataframe durante as alterações utilize o método .tail() para exibir as últimas linhas do dataframe.

In [27]:
df25 = pd.concat([df24, pd.DataFrame([[np.nan] * df24.shape[1]], columns=df24.columns)], ignore_index=True)
df25.fillna(df25.median(), inplace = True)
df25.fillna(method = 'ffill', axis = 0, inplace = True)
df25.tail()

          Number    City  Gender   Age    Income Illness  Random 1  Random 2
149996  149997.0  Austin    Male  25.0   96748.0      No -1.225631  1.212723
149997  149998.0  Austin    Male  26.0  111885.0      No  0.176426  0.418778
149998  149999.0  Austin    Male  25.0  111878.0      No -0.653005  0.972968
149999  150000.0  Austin  Female  37.0   87251.0      No  0.388007  1.392892
150000   75000.5  Austin  Female  45.0   93655.0      No -0.001921 -0.000520

40 - Liste sem repetição as cidades que estão presentes no dataframe.

In [40]:
df26 = df4['City'].unique()
df26

array(['Dallas', 'New York City', 'Los Angeles', 'Mountain View',
       'Boston', 'Washington D.C.', 'San Diego', 'Austin'], dtype=object)

41 - Crie uma função anônima *lambda* que receba cada idade e a incremente com +1. Aplique essa função na coluna Age do dataframe.

In [46]:
df27 = df25['Age'].apply(lambda x: x + 1)
df27

0         42.0
1         55.0
2         43.0
3         41.0
4         47.0
          ...
149996    26.0
149997    27.0
149998    26.0
149999    38.0
150000    46.0
Name: Age, Length: 150001, dtype: float64

42 - Crie um novo dataframe a partir do "toy" dataframe. **Este deve utilizar as diferentes cidades como índices e ambos os gêneros como colunas, informando para cada cidade a idade média**. Dica: considere criar uma pivot table.

In [60]:
df28 = df4.pivot_table(values = 'Age', index = ['City'], columns = ['Gender'])
df28

Gender              Female       Male
City
Austin           44.505478  44.764876
Boston           45.219112  45.180549
Dallas           45.141987  44.992910
Los Angeles      44.963668  45.018392
Mountain View    45.011791  44.977716
New York City    45.037976  44.830816
San Diego        45.093422  44.868487
Washington D.C.  44.964085  44.676471

### Introduzindo as Funções Merge e Join

43 - Abaixo pode-se conferir dois dicionários referentes à registros de desempenho escolar de estudantes em duas disciplinas diferentes. No dicionário referente a disciplina de Matemática, a lista de CPFs dos alunos pode ser acessada através da chave 'CPF', enquanto para o dicionário de Química a chave referente aos CPFs é denominada 'Matricula'. Dado que alguns estudantes que fazem parte da disciplina de matemática, também estão presentes na turma de química, realize as seguintes operações:
1. Crie um dataframe para cada disciplina.
2. Utilize as colunas que contêm os dados de CPF para criar um dataframe final contendo somente os registros dos alunos que contemplaram ambas as disciplinas. O dataframe deve conter somente as colunas 'CPF', 'Nome', 'Nota_Matemática', 'Matricula' e 'Nota_Química'.

In [68]:
matematica = {'CPF': [34160272215, 63862254062, 88415367805, 88134932070], 'Nome':['Álex', 'Noah', 'Sam', 'Kim'], 'Nota_Matemática': [8.95, 9.1, 7.9, 9.2]}
quimica = {'Matricula': [63862254062, 24208455012, 27440174003, 88415367805], 'Nome':['Noah', 'Dirceu', 'Dominique', 'Sam'], 'Nota_Química': [7.79, 8.2, 7.5, 8.2]}

# Passo 1
dfmat = pd.DataFrame.from_dict(matematica)
dfqui = pd.DataFrame.from_dict(quimica)

# Passo 2
dfMeQ = pd.merge(dfmat, dfqui, how = 'inner', on = ['Nome'])
dfMeQ

           CPF  Nome  Nota_Matemática    Matricula  Nota_Química
0  63862254062  Noah              9.1  63862254062          7.79
1  88415367805   Sam              7.9  88415367805          8.20

44 - A partir da questão anterior, utilize os dois dataframes criados para cada disciplina e defina o CPF como o índice de ambos os objetos. Em seguida, utilize os índices do dataframe para criar uma nova base contendo somente os registros dos alunos que contemplaram ambas as disciplinas. O dataframe deve conter as colunas 'CPF', 'Nome', 'Nota_Matemática', 'Matricula' e 'Nota_Química'.

In [66]:
dfmat = pd.DataFrame.from_dict(matematica)
dfqui = pd.DataFrame.from_dict(quimica)
dfmat1 = dfmat.set_index('CPF')
dfqui1 = dfqui.set_index('Matricula')

dfMeQ1 = pd.merge(dfmat, dfqui, how = 'inner', on = ['Nome'])
dfMeQ1

           CPF  Nome  Nota_Matemática    Matricula  Nota_Química
0  63862254062  Noah              9.1  63862254062          7.79
1  88415367805   Sam              7.9  88415367805          8.20

45 - Ainda utilizando o dataframe da questão anterior, apresente desta vez a união entre ambos, de forma a apresentar todos os alunos que contenplaram alguma das disciplinas

In [69]:
dfMeQ2 = pd.merge(dfmat, dfqui, how = 'outer', on = ['Nome'])
dfMeQ2

            CPF       Nome  Nota_Matemática     Matricula  Nota_Química
0  3.416027e+10       Álex             8.95           NaN           NaN
1  6.386225e+10       Noah             9.10  6.386225e+10          7.79
2  8.841537e+10        Sam             7.90  8.841537e+10          8.20
3  8.813493e+10        Kim             9.20           NaN           NaN
4           NaN     Dirceu              NaN  2.420846e+10          8.20
5           NaN  Dominique              NaN  2.744017e+10          7.50

46 - Salve o dataframe resultante da questão anterior em um csv.

In [72]:
dfMeQ2.to_csv('notas.csv')